zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PD03A_GMAC_GTX1                        _UINT32_(99)         /* GMAC signal: GMAC_GTX1 on PD03 mux A */
#define MUX_PD03A_GMAC_GTX1                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GTX1 */
#define PIO_PD03A_GMAC_GTX1                        (_UINT32_(1) << 3)   /* GMAC signal: GMAC_GTX1 */

#define PIN_PD15A_GMAC_GTX2                        _UINT32_(111)        /* GMAC signal: GMAC_GTX2 on PD15 mux A */
#define MUX_PD15A_GMAC_GTX2                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GTX2 */
#define PIO_PD15A_GMAC_GTX2                        (_UINT32_(1) << 15)  /* GMAC signal: GMAC_GTX2 */

#define PIN_PD16A_GMAC_GTX3                        _UINT32_(112)        /* GMAC signal: GMAC_GTX3 on PD16 mux A */
#define MUX_PD16A_GMAC_GTX3                        _UINT32_(0)          /* GMAC signal line function value: GMAC_GTX3 */
#define PIO_PD16A_GMAC_GTX3                        (_UINT32_(1) << 16)  /* GMAC signal: GMAC_GTX3 */

#define PIN_PD00A_GMAC_GTXCK                       _UINT32_(96)         /* GMAC signal: GMAC_GTXCK on PD00 mux A */
#define MUX_PD00A_GMAC_GTXCK                       _UINT32_(0)          /* GMAC signal line function value: GMAC_GTXCK */
#define PIO_PD00A_GMAC_GTXCK                       (_UINT32_(1) << 0)   /* GMAC signal: GMAC_GTXCK */

#define PIN_PD01A_GMAC_GTXEN                       _UINT32_(97)         /* GMAC signal: GMAC_GTXEN on PD01 mux A */
#define MUX_PD01A_GMAC_GTXEN                       _UINT32_(0)          /* GMAC signal line function value: GMAC_GTXEN */
#define PIO_PD01A_GMAC_GTXEN                       (_UINT32_(1) << 1)   /* GMAC signal: GMAC_GTXEN */

#define PIN_PD17A_GMAC_GTXER                       _UINT32_(113)        /* GMAC signal: GMAC_GTXER on PD17 mux A */
#define MUX_PD17A_GMAC_GTXER                       _UINT32_(0)          /* GMAC signal line function value: GMAC_GTXER */
#define PIO_PD17A_GMAC_GTXER                       (_UINT32_(1) << 17)  /* GMAC signal: GMAC_GTXER */

/* ================== PIO definition for HSMCI peripheral =================== */
#define PIN_PA28C_HSMCI_MCCDA                      _UINT32_(28)         /* HSMCI signal: HSMCI_MCCDA on PA28 mux C */
#define MUX_PA28C_HSMCI_MCCDA                      _UINT32_(2)          /* HSMCI signal line function value: HSMCI_MCCDA */
#define PIO_PA28C_HSMCI_MCCDA                      (_UINT32_(1) << 28)  /* HSMCI signal: HSMCI_MCCDA */

#define PIN_PA25D_HSMCI_MCCK                       _UINT32_(25)         /* HSMCI signal: HSMCI_MCCK on PA25 mux D */
#define MUX_PA25D_HSMCI_MCCK                       _UINT32_(3)          /* HSMCI signal line function value: HSMCI_MCCK */
#define PIO_PA25D_HSMCI_MCCK                       (_UINT32_(1) << 25)  /* HSMCI signal: HSMCI_MCCK */

#define PIN_PA30C_HSMCI_MCDA0                      _UINT32_(30)         /* HSMCI signal: HSMCI_MCDA0 on PA30 mux C */
#define MUX_PA30C_HSMCI_MCDA0                      _UINT32_(2)          /* HSMCI signal line function value: HSMCI_MCDA0 */
#define PIO_PA30C_HSMCI_MCDA0                      (_UINT32_(1) << 30)  /* HSMCI signal: HSMCI_MCDA0 */

#define PIN_PA31C_HSMCI_MCDA1                      _UINT32_(31)         /* HSMCI signal: HSMCI_MCDA1 on PA31 mux C */
#define MUX_PA31C_HSMCI_MCDA1                      _UINT32_(2)          /* HSMCI signal line function value: HSMCI_MCDA1 */
#define PIO_PA31C_HSMCI_MCDA1                      (_UINT32_(1) << 31)  /* HSMCI signal: HSMCI_MCDA1 */

#define PIN_PA26C_HSMCI_MCDA2                      _UINT32_(26)         /* HSMCI signal: HSMCI_MCDA2 on PA26 mux C */
#define MUX_PA26C_HSMCI_MCDA2                      _UINT32_(2)          /* HSMCI signal line function value: HSMCI_MCDA2 */
#define PIO_PA26C_HSMCI_MCDA2                      (_UINT32_(1) << 26)  /* HSMCI signal: HSMCI_MCDA2 */

#define PIN_PA27C_HSMCI_MCDA3                      _UINT32_(27)         /* HSMCI signal: HSMCI_MCDA3 on PA27 mux C */
#define MUX_PA27C_HSMCI_MCDA3                      _UINT32_(2)          /* HSMCI signal line function value: HSMCI_MCDA3 */
#define PIO_PA27C_HSMCI_MCDA3                      (_UINT32_(1) << 27)  /* HSMCI signal: HSMCI_MCDA3 */

/* ================== PIO definition for I2SC0 peripheral =================== */
#define PIN_PA01D_I2SC0_CK                         _UINT32_(1)          /* I2SC0 signal: I2SC0_CK on PA01 mux D */
#define MUX_PA01D_I2SC0_CK                         _UINT32_(3)          /* I2SC0 signal line function value: I2SC0_CK */
#define PIO_PA01D_I2SC0_CK                         (_UINT32_(1) << 1)   /* I2SC0 signal: I2SC0_CK */

#define PIN_PA16D_I2SC0_DI0                        _UINT32_(16)         /* I2SC0 signal: I2SC0_DI0 on PA16 mux D */
#define MUX_PA16D_I2SC0_DI0                        _UINT32_(3)          /* I2SC0 signal line function value: I2SC0_DI0 */
#define PIO_PA16D_I2SC0_DI0                        (_UINT32_(1) << 16)  /* I2SC0 signal: I2SC0_DI0 */

#define PIN_PA30D_I2SC0_DO0                        _UINT32_(30)         /* I2SC0 signal: I2SC0_DO0 on PA30 mux D */
#define MUX_PA30D_I2SC0_DO0                        _UINT32_(3)          /* I2SC0 signal line function value: I2SC0_DO0 */
#define PIO_PA30D_I2SC0_DO0                        (_UINT32_(1) << 30)  /* I2SC0 signal: I2SC0_DO0 */

#define PIN_PA00D_I2SC0_MCK                        _UINT32_(0)          /* I2SC0 signal: I2SC0_MCK on PA00 mux D */
#define MUX_PA00D_I2SC0_MCK                        _UINT32_(3)          /* I2SC0 signal line function value: I2SC0_MCK */
#define PIO_PA00D_I2SC0_MCK                        (_UINT32_(1) << 0)   /* I2SC0 signal: I2SC0_MCK */

#define PIN_PA15D_I2SC0_WS                         _UINT32_(15)         /* I2SC0 signal: I2SC0_WS on PA15 mux D */
#define MUX_PA15D_I2SC0_WS                         _UINT32_(3)          /* I2SC0 signal line function value: I2SC0_WS */
#define PIO_PA15D_I2SC0_WS                         (_UINT32_(1) << 15)  /* I2SC0 signal: I2SC0_WS */

/* =================== PIO definition for ISI peripheral ==================== */
#define PIN_PD22D_ISI_D0                           _UINT32_(118)        /* ISI signal: ISI_D0 on PD22 mux D */
#define MUX_PD22D_ISI_D0                           _UINT32_(3)          /* ISI signal line function value: ISI_D0 */
#define PIO_PD22D_ISI_D0                           (_UINT32_(1) << 22)  /* ISI signal: ISI_D0 */

#define PIN_PD21D_ISI_D1                           _UINT32_(117)        /* ISI signal: ISI_D1 on PD21 mux D */
#define MUX_PD21D_ISI_D1                           _UINT32_(3)          /* ISI signal line function value: ISI_D1 */
#define PIO_PD21D_ISI_D1                           (_UINT32_(1) << 21)  /* ISI signal: ISI_D1 */

