zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PB03D_ISI_D2                           _UINT32_(35)         /* ISI signal: ISI_D2 on PB03 mux D */
#define MUX_PB03D_ISI_D2                           _UINT32_(3)          /* ISI signal line function value: ISI_D2 */
#define PIO_PB03D_ISI_D2                           (_UINT32_(1) << 3)   /* ISI signal: ISI_D2 */

#define PIN_PA09B_ISI_D3                           _UINT32_(9)          /* ISI signal: ISI_D3 on PA09 mux B */
#define MUX_PA09B_ISI_D3                           _UINT32_(1)          /* ISI signal line function value: ISI_D3 */
#define PIO_PA09B_ISI_D3                           (_UINT32_(1) << 9)   /* ISI signal: ISI_D3 */

#define PIN_PA05B_ISI_D4                           _UINT32_(5)          /* ISI signal: ISI_D4 on PA05 mux B */
#define MUX_PA05B_ISI_D4                           _UINT32_(1)          /* ISI signal line function value: ISI_D4 */
#define PIO_PA05B_ISI_D4                           (_UINT32_(1) << 5)   /* ISI signal: ISI_D4 */

#define PIN_PD11D_ISI_D5                           _UINT32_(107)        /* ISI signal: ISI_D5 on PD11 mux D */
#define MUX_PD11D_ISI_D5                           _UINT32_(3)          /* ISI signal line function value: ISI_D5 */
#define PIO_PD11D_ISI_D5                           (_UINT32_(1) << 11)  /* ISI signal: ISI_D5 */

#define PIN_PD12D_ISI_D6                           _UINT32_(108)        /* ISI signal: ISI_D6 on PD12 mux D */
#define MUX_PD12D_ISI_D6                           _UINT32_(3)          /* ISI signal line function value: ISI_D6 */
#define PIO_PD12D_ISI_D6                           (_UINT32_(1) << 12)  /* ISI signal: ISI_D6 */

#define PIN_PA27D_ISI_D7                           _UINT32_(27)         /* ISI signal: ISI_D7 on PA27 mux D */
#define MUX_PA27D_ISI_D7                           _UINT32_(3)          /* ISI signal line function value: ISI_D7 */
#define PIO_PA27D_ISI_D7                           (_UINT32_(1) << 27)  /* ISI signal: ISI_D7 */

#define PIN_PD27D_ISI_D8                           _UINT32_(123)        /* ISI signal: ISI_D8 on PD27 mux D */
#define MUX_PD27D_ISI_D8                           _UINT32_(3)          /* ISI signal line function value: ISI_D8 */
#define PIO_PD27D_ISI_D8                           (_UINT32_(1) << 27)  /* ISI signal: ISI_D8 */

#define PIN_PD28D_ISI_D9                           _UINT32_(124)        /* ISI signal: ISI_D9 on PD28 mux D */
#define MUX_PD28D_ISI_D9                           _UINT32_(3)          /* ISI signal line function value: ISI_D9 */
#define PIO_PD28D_ISI_D9                           (_UINT32_(1) << 28)  /* ISI signal: ISI_D9 */

#define PIN_PD30D_ISI_D10                          _UINT32_(126)        /* ISI signal: ISI_D10 on PD30 mux D */
#define MUX_PD30D_ISI_D10                          _UINT32_(3)          /* ISI signal line function value: ISI_D10 */
#define PIO_PD30D_ISI_D10                          (_UINT32_(1) << 30)  /* ISI signal: ISI_D10 */

#define PIN_PD31D_ISI_D11                          _UINT32_(127)        /* ISI signal: ISI_D11 on PD31 mux D */
#define MUX_PD31D_ISI_D11                          _UINT32_(3)          /* ISI signal line function value: ISI_D11 */
#define PIO_PD31D_ISI_D11                          (_UINT32_(1) << 31)  /* ISI signal: ISI_D11 */

#define PIN_PD24D_ISI_HSYNC                        _UINT32_(120)        /* ISI signal: ISI_HSYNC on PD24 mux D */
#define MUX_PD24D_ISI_HSYNC                        _UINT32_(3)          /* ISI signal line function value: ISI_HSYNC */
#define PIO_PD24D_ISI_HSYNC                        (_UINT32_(1) << 24)  /* ISI signal: ISI_HSYNC */

#define PIN_PA24D_ISI_PCK                          _UINT32_(24)         /* ISI signal: ISI_PCK on PA24 mux D */
#define MUX_PA24D_ISI_PCK                          _UINT32_(3)          /* ISI signal line function value: ISI_PCK */
#define PIO_PA24D_ISI_PCK                          (_UINT32_(1) << 24)  /* ISI signal: ISI_PCK */

#define PIN_PD25D_ISI_VSYNC                        _UINT32_(121)        /* ISI signal: ISI_VSYNC on PD25 mux D */
#define MUX_PD25D_ISI_VSYNC                        _UINT32_(3)          /* ISI signal line function value: ISI_VSYNC */
#define PIO_PD25D_ISI_VSYNC                        (_UINT32_(1) << 25)  /* ISI signal: ISI_VSYNC */

/* ================== PIO definition for MCAN0 peripheral =================== */
#define PIN_PB03A_MCAN0_CANRX0                     _UINT32_(35)         /* MCAN0 signal: MCAN0_CANRX0 on PB03 mux A */
#define MUX_PB03A_MCAN0_CANRX0                     _UINT32_(0)          /* MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PB03A_MCAN0_CANRX0                     (_UINT32_(1) << 3)   /* MCAN0 signal: MCAN0_CANRX0 */

#define PIN_PB02A_MCAN0_CANTX0                     _UINT32_(34)         /* MCAN0 signal: MCAN0_CANTX0 on PB02 mux A */
#define MUX_PB02A_MCAN0_CANTX0                     _UINT32_(0)          /* MCAN0 signal line function value: MCAN0_CANTX0 */
#define PIO_PB02A_MCAN0_CANTX0                     (_UINT32_(1) << 2)   /* MCAN0 signal: MCAN0_CANTX0 */

/* ================== PIO definition for MCAN1 peripheral =================== */
#define PIN_PD28B_MCAN1_CANRX1                     _UINT32_(124)        /* MCAN1 signal: MCAN1_CANRX1 on PD28 mux B */
#define MUX_PD28B_MCAN1_CANRX1                     _UINT32_(1)          /* MCAN1 signal line function value: MCAN1_CANRX1 */
#define PIO_PD28B_MCAN1_CANRX1                     (_UINT32_(1) << 28)  /* MCAN1 signal: MCAN1_CANRX1 */

#define PIN_PD12B_MCAN1_CANTX1                     _UINT32_(108)        /* MCAN1 signal: MCAN1_CANTX1 on PD12 mux B */
#define MUX_PD12B_MCAN1_CANTX1                     _UINT32_(1)          /* MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PD12B_MCAN1_CANTX1                     (_UINT32_(1) << 12)  /* MCAN1 signal: MCAN1_CANTX1 */

/* =================== PIO definition for MLB peripheral ==================== */
#define PIN_PB04C_MLB_MLBCLK                       _UINT32_(36)         /* MLB signal: MLB_MLBCLK on PB04 mux C */
#define MUX_PB04C_MLB_MLBCLK                       _UINT32_(2)          /* MLB signal line function value: MLB_MLBCLK */
#define PIO_PB04C_MLB_MLBCLK                       (_UINT32_(1) << 4)   /* MLB signal: MLB_MLBCLK */

#define PIN_PB05C_MLB_MLBDAT                       _UINT32_(37)         /* MLB signal: MLB_MLBDAT on PB05 mux C */
#define MUX_PB05C_MLB_MLBDAT                       _UINT32_(2)          /* MLB signal line function value: MLB_MLBDAT */
#define PIO_PB05C_MLB_MLBDAT                       (_UINT32_(1) << 5)   /* MLB signal: MLB_MLBDAT */

#define PIN_PD10D_MLB_MLBSIG                       _UINT32_(106)        /* MLB signal: MLB_MLBSIG on PD10 mux D */
#define MUX_PD10D_MLB_MLBSIG                       _UINT32_(3)          /* MLB signal line function value: MLB_MLBSIG */
#define PIO_PD10D_MLB_MLBSIG                       (_UINT32_(1) << 10)  /* MLB signal: MLB_MLBSIG */

/* =================== PIO definition for PMC peripheral ==================== */
#define PIN_PA06B_PMC_PCK0                         _UINT32_(6)          /* PMC signal: PMC_PCK0 on PA06 mux B */
#define MUX_PA06B_PMC_PCK0                         _UINT32_(1)          /* PMC signal line function value: PMC_PCK0 */
#define PIO_PA06B_PMC_PCK0                         (_UINT32_(1) << 6)   /* PMC signal: PMC_PCK0 */

#define PIN_PB12D_PMC_PCK0                         _UINT32_(44)         /* PMC signal: PMC_PCK0 on PB12 mux D */
#define MUX_PB12D_PMC_PCK0                         _UINT32_(3)          /* PMC signal line function value: PMC_PCK0 */
#define PIO_PB12D_PMC_PCK0                         (_UINT32_(1) << 12)  /* PMC signal: PMC_PCK0 */

