zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PB13B_PMC_PCK0                         _UINT32_(45)         /* PMC signal: PMC_PCK0 on PB13 mux B */
#define MUX_PB13B_PMC_PCK0                         _UINT32_(1)          /* PMC signal line function value: PMC_PCK0 */
#define PIO_PB13B_PMC_PCK0                         (_UINT32_(1) << 13)  /* PMC signal: PMC_PCK0 */

#define PIN_PA17B_PMC_PCK1                         _UINT32_(17)         /* PMC signal: PMC_PCK1 on PA17 mux B */
#define MUX_PA17B_PMC_PCK1                         _UINT32_(1)          /* PMC signal line function value: PMC_PCK1 */
#define PIO_PA17B_PMC_PCK1                         (_UINT32_(1) << 17)  /* PMC signal: PMC_PCK1 */

#define PIN_PA21B_PMC_PCK1                         _UINT32_(21)         /* PMC signal: PMC_PCK1 on PA21 mux B */
#define MUX_PA21B_PMC_PCK1                         _UINT32_(1)          /* PMC signal line function value: PMC_PCK1 */
#define PIO_PA21B_PMC_PCK1                         (_UINT32_(1) << 21)  /* PMC signal: PMC_PCK1 */

#define PIN_PA03C_PMC_PCK2                         _UINT32_(3)          /* PMC signal: PMC_PCK2 on PA03 mux C */
#define MUX_PA03C_PMC_PCK2                         _UINT32_(2)          /* PMC signal line function value: PMC_PCK2 */
#define PIO_PA03C_PMC_PCK2                         (_UINT32_(1) << 3)   /* PMC signal: PMC_PCK2 */

#define PIN_PA18B_PMC_PCK2                         _UINT32_(18)         /* PMC signal: PMC_PCK2 on PA18 mux B */
#define MUX_PA18B_PMC_PCK2                         _UINT32_(1)          /* PMC signal line function value: PMC_PCK2 */
#define PIO_PA18B_PMC_PCK2                         (_UINT32_(1) << 18)  /* PMC signal: PMC_PCK2 */

#define PIN_PA31B_PMC_PCK2                         _UINT32_(31)         /* PMC signal: PMC_PCK2 on PA31 mux B */
#define MUX_PA31B_PMC_PCK2                         _UINT32_(1)          /* PMC signal line function value: PMC_PCK2 */
#define PIO_PA31B_PMC_PCK2                         (_UINT32_(1) << 31)  /* PMC signal: PMC_PCK2 */

#define PIN_PB03B_PMC_PCK2                         _UINT32_(35)         /* PMC signal: PMC_PCK2 on PB03 mux B */
#define MUX_PB03B_PMC_PCK2                         _UINT32_(1)          /* PMC signal line function value: PMC_PCK2 */
#define PIO_PB03B_PMC_PCK2                         (_UINT32_(1) << 3)   /* PMC signal: PMC_PCK2 */

#define PIN_PD31C_PMC_PCK2                         _UINT32_(127)        /* PMC signal: PMC_PCK2 on PD31 mux C */
#define MUX_PD31C_PMC_PCK2                         _UINT32_(2)          /* PMC signal line function value: PMC_PCK2 */
#define PIO_PD31C_PMC_PCK2                         (_UINT32_(1) << 31)  /* PMC signal: PMC_PCK2 */

#define PIN_PB09X1_PMC_XIN                         _UINT32_(41)         /* PMC signal: PMC_XIN on PB09 mux X1 */
#define PIO_PB09X1_PMC_XIN                         (_UINT32_(1) << 9)   /* PMC signal: PMC_XIN */

#define PIN_PA07X1_PMC_XIN32                       _UINT32_(7)          /* PMC signal: PMC_XIN32 on PA07 mux X1 */
#define PIO_PA07X1_PMC_XIN32                       (_UINT32_(1) << 7)   /* PMC signal: PMC_XIN32 */

#define PIN_PB08X1_PMC_XOUT                        _UINT32_(40)         /* PMC signal: PMC_XOUT on PB08 mux X1 */
#define PIO_PB08X1_PMC_XOUT                        (_UINT32_(1) << 8)   /* PMC signal: PMC_XOUT */

#define PIN_PA08X1_PMC_XOUT32                      _UINT32_(8)          /* PMC signal: PMC_XOUT32 on PA08 mux X1 */
#define PIO_PA08X1_PMC_XOUT32                      (_UINT32_(1) << 8)   /* PMC signal: PMC_XOUT32 */

/* =================== PIO definition for PWM0 peripheral =================== */
#define PIN_PA10B_PWM0_PWMEXTRG0                   _UINT32_(10)         /* PWM0 signal: PWM0_PWMEXTRG0 on PA10 mux B */
#define MUX_PA10B_PWM0_PWMEXTRG0                   _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMEXTRG0 */
#define PIO_PA10B_PWM0_PWMEXTRG0                   (_UINT32_(1) << 10)  /* PWM0 signal: PWM0_PWMEXTRG0 */

#define PIN_PA22B_PWM0_PWMEXTRG1                   _UINT32_(22)         /* PWM0 signal: PWM0_PWMEXTRG1 on PA22 mux B */
#define MUX_PA22B_PWM0_PWMEXTRG1                   _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMEXTRG1 */
#define PIO_PA22B_PWM0_PWMEXTRG1                   (_UINT32_(1) << 22)  /* PWM0 signal: PWM0_PWMEXTRG1 */

#define PIN_PA09C_PWM0_PWMFI0                      _UINT32_(9)          /* PWM0 signal: PWM0_PWMFI0 on PA09 mux C */
#define MUX_PA09C_PWM0_PWMFI0                      _UINT32_(2)          /* PWM0 signal line function value: PWM0_PWMFI0 */
#define PIO_PA09C_PWM0_PWMFI0                      (_UINT32_(1) << 9)   /* PWM0 signal: PWM0_PWMFI0 */

#define PIN_PD08B_PWM0_PWMFI1                      _UINT32_(104)        /* PWM0 signal: PWM0_PWMFI1 on PD08 mux B */
#define MUX_PD08B_PWM0_PWMFI1                      _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMFI1 */
#define PIO_PD08B_PWM0_PWMFI1                      (_UINT32_(1) << 8)   /* PWM0 signal: PWM0_PWMFI1 */

#define PIN_PD09B_PWM0_PWMFI2                      _UINT32_(105)        /* PWM0 signal: PWM0_PWMFI2 on PD09 mux B */
#define MUX_PD09B_PWM0_PWMFI2                      _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMFI2 */
#define PIO_PD09B_PWM0_PWMFI2                      (_UINT32_(1) << 9)   /* PWM0 signal: PWM0_PWMFI2 */

#define PIN_PA00A_PWM0_PWMH0                       _UINT32_(0)          /* PWM0 signal: PWM0_PWMH0 on PA00 mux A */
#define MUX_PA00A_PWM0_PWMH0                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PA00A_PWM0_PWMH0                       (_UINT32_(1) << 0)   /* PWM0 signal: PWM0_PWMH0 */

#define PIN_PA11B_PWM0_PWMH0                       _UINT32_(11)         /* PWM0 signal: PWM0_PWMH0 on PA11 mux B */
#define MUX_PA11B_PWM0_PWMH0                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PA11B_PWM0_PWMH0                       (_UINT32_(1) << 11)  /* PWM0 signal: PWM0_PWMH0 */

#define PIN_PA23B_PWM0_PWMH0                       _UINT32_(23)         /* PWM0 signal: PWM0_PWMH0 on PA23 mux B */
#define MUX_PA23B_PWM0_PWMH0                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PA23B_PWM0_PWMH0                       (_UINT32_(1) << 23)  /* PWM0 signal: PWM0_PWMH0 */

#define PIN_PB00A_PWM0_PWMH0                       _UINT32_(32)         /* PWM0 signal: PWM0_PWMH0 on PB00 mux A */
#define MUX_PB00A_PWM0_PWMH0                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PB00A_PWM0_PWMH0                       (_UINT32_(1) << 0)   /* PWM0 signal: PWM0_PWMH0 */

#define PIN_PD11B_PWM0_PWMH0                       _UINT32_(107)        /* PWM0 signal: PWM0_PWMH0 on PD11 mux B */
#define MUX_PD11B_PWM0_PWMH0                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PD11B_PWM0_PWMH0                       (_UINT32_(1) << 11)  /* PWM0 signal: PWM0_PWMH0 */

#define PIN_PD20A_PWM0_PWMH0                       _UINT32_(116)        /* PWM0 signal: PWM0_PWMH0 on PD20 mux A */
#define MUX_PD20A_PWM0_PWMH0                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWMH0 */
#define PIO_PD20A_PWM0_PWMH0                       (_UINT32_(1) << 20)  /* PWM0 signal: PWM0_PWMH0 */

#define PIN_PA02A_PWM0_PWMH1                       _UINT32_(2)          /* PWM0 signal: PWM0_PWMH1 on PA02 mux A */
#define MUX_PA02A_PWM0_PWMH1                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PA02A_PWM0_PWMH1                       (_UINT32_(1) << 2)   /* PWM0 signal: PWM0_PWMH1 */

#define PIN_PA12B_PWM0_PWMH1                       _UINT32_(12)         /* PWM0 signal: PWM0_PWMH1 on PA12 mux B */
#define MUX_PA12B_PWM0_PWMH1                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PA12B_PWM0_PWMH1                       (_UINT32_(1) << 12)  /* PWM0 signal: PWM0_PWMH1 */

