zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PA24B_PWM0_PWMH1                       _UINT32_(24)         /* PWM0 signal: PWM0_PWMH1 on PA24 mux B */
#define MUX_PA24B_PWM0_PWMH1                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PA24B_PWM0_PWMH1                       (_UINT32_(1) << 24)  /* PWM0 signal: PWM0_PWMH1 */

#define PIN_PB01A_PWM0_PWMH1                       _UINT32_(33)         /* PWM0 signal: PWM0_PWMH1 on PB01 mux A */
#define MUX_PB01A_PWM0_PWMH1                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PB01A_PWM0_PWMH1                       (_UINT32_(1) << 1)   /* PWM0 signal: PWM0_PWMH1 */

#define PIN_PD21A_PWM0_PWMH1                       _UINT32_(117)        /* PWM0 signal: PWM0_PWMH1 on PD21 mux A */
#define MUX_PD21A_PWM0_PWMH1                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWMH1 */
#define PIO_PD21A_PWM0_PWMH1                       (_UINT32_(1) << 21)  /* PWM0 signal: PWM0_PWMH1 */

#define PIN_PA13B_PWM0_PWMH2                       _UINT32_(13)         /* PWM0 signal: PWM0_PWMH2 on PA13 mux B */
#define MUX_PA13B_PWM0_PWMH2                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PA13B_PWM0_PWMH2                       (_UINT32_(1) << 13)  /* PWM0 signal: PWM0_PWMH2 */

#define PIN_PA25B_PWM0_PWMH2                       _UINT32_(25)         /* PWM0 signal: PWM0_PWMH2 on PA25 mux B */
#define MUX_PA25B_PWM0_PWMH2                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PA25B_PWM0_PWMH2                       (_UINT32_(1) << 25)  /* PWM0 signal: PWM0_PWMH2 */

#define PIN_PB04B_PWM0_PWMH2                       _UINT32_(36)         /* PWM0 signal: PWM0_PWMH2 on PB04 mux B */
#define MUX_PB04B_PWM0_PWMH2                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PB04B_PWM0_PWMH2                       (_UINT32_(1) << 4)   /* PWM0 signal: PWM0_PWMH2 */

#define PIN_PD22A_PWM0_PWMH2                       _UINT32_(118)        /* PWM0 signal: PWM0_PWMH2 on PD22 mux A */
#define MUX_PD22A_PWM0_PWMH2                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWMH2 */
#define PIO_PD22A_PWM0_PWMH2                       (_UINT32_(1) << 22)  /* PWM0 signal: PWM0_PWMH2 */

#define PIN_PA07B_PWM0_PWMH3                       _UINT32_(7)          /* PWM0 signal: PWM0_PWMH3 on PA07 mux B */
#define MUX_PA07B_PWM0_PWMH3                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PA07B_PWM0_PWMH3                       (_UINT32_(1) << 7)   /* PWM0 signal: PWM0_PWMH3 */

#define PIN_PA14B_PWM0_PWMH3                       _UINT32_(14)         /* PWM0 signal: PWM0_PWMH3 on PA14 mux B */
#define MUX_PA14B_PWM0_PWMH3                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PA14B_PWM0_PWMH3                       (_UINT32_(1) << 14)  /* PWM0 signal: PWM0_PWMH3 */

#define PIN_PA17C_PWM0_PWMH3                       _UINT32_(17)         /* PWM0 signal: PWM0_PWMH3 on PA17 mux C */
#define MUX_PA17C_PWM0_PWMH3                       _UINT32_(2)          /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PA17C_PWM0_PWMH3                       (_UINT32_(1) << 17)  /* PWM0 signal: PWM0_PWMH3 */

#define PIN_PD23A_PWM0_PWMH3                       _UINT32_(119)        /* PWM0 signal: PWM0_PWMH3 on PD23 mux A */
#define MUX_PD23A_PWM0_PWMH3                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWMH3 */
#define PIO_PD23A_PWM0_PWMH3                       (_UINT32_(1) << 23)  /* PWM0 signal: PWM0_PWMH3 */

#define PIN_PA01A_PWM0_PWML0                       _UINT32_(1)          /* PWM0 signal: PWM0_PWML0 on PA01 mux A */
#define MUX_PA01A_PWM0_PWML0                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PA01A_PWM0_PWML0                       (_UINT32_(1) << 1)   /* PWM0 signal: PWM0_PWML0 */

#define PIN_PA19B_PWM0_PWML0                       _UINT32_(19)         /* PWM0 signal: PWM0_PWML0 on PA19 mux B */
#define MUX_PA19B_PWM0_PWML0                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PA19B_PWM0_PWML0                       (_UINT32_(1) << 19)  /* PWM0 signal: PWM0_PWML0 */

#define PIN_PB05B_PWM0_PWML0                       _UINT32_(37)         /* PWM0 signal: PWM0_PWML0 on PB05 mux B */
#define MUX_PB05B_PWM0_PWML0                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PB05B_PWM0_PWML0                       (_UINT32_(1) << 5)   /* PWM0 signal: PWM0_PWML0 */

#define PIN_PD10B_PWM0_PWML0                       _UINT32_(106)        /* PWM0 signal: PWM0_PWML0 on PD10 mux B */
#define MUX_PD10B_PWM0_PWML0                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PD10B_PWM0_PWML0                       (_UINT32_(1) << 10)  /* PWM0 signal: PWM0_PWML0 */

#define PIN_PD24A_PWM0_PWML0                       _UINT32_(120)        /* PWM0 signal: PWM0_PWML0 on PD24 mux A */
#define MUX_PD24A_PWM0_PWML0                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML0 */
#define PIO_PD24A_PWM0_PWML0                       (_UINT32_(1) << 24)  /* PWM0 signal: PWM0_PWML0 */

#define PIN_PA20B_PWM0_PWML1                       _UINT32_(20)         /* PWM0 signal: PWM0_PWML1 on PA20 mux B */
#define MUX_PA20B_PWM0_PWML1                       _UINT32_(1)          /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PA20B_PWM0_PWML1                       (_UINT32_(1) << 20)  /* PWM0 signal: PWM0_PWML1 */

#define PIN_PB12A_PWM0_PWML1                       _UINT32_(44)         /* PWM0 signal: PWM0_PWML1 on PB12 mux A */
#define MUX_PB12A_PWM0_PWML1                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PB12A_PWM0_PWML1                       (_UINT32_(1) << 12)  /* PWM0 signal: PWM0_PWML1 */

#define PIN_PD25A_PWM0_PWML1                       _UINT32_(121)        /* PWM0 signal: PWM0_PWML1 on PD25 mux A */
#define MUX_PD25A_PWM0_PWML1                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML1 */
#define PIO_PD25A_PWM0_PWML1                       (_UINT32_(1) << 25)  /* PWM0 signal: PWM0_PWML1 */

#define PIN_PA16C_PWM0_PWML2                       _UINT32_(16)         /* PWM0 signal: PWM0_PWML2 on PA16 mux C */
#define MUX_PA16C_PWM0_PWML2                       _UINT32_(2)          /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PA16C_PWM0_PWML2                       (_UINT32_(1) << 16)  /* PWM0 signal: PWM0_PWML2 */

#define PIN_PA30A_PWM0_PWML2                       _UINT32_(30)         /* PWM0 signal: PWM0_PWML2 on PA30 mux A */
#define MUX_PA30A_PWM0_PWML2                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PA30A_PWM0_PWML2                       (_UINT32_(1) << 30)  /* PWM0 signal: PWM0_PWML2 */

#define PIN_PB13A_PWM0_PWML2                       _UINT32_(45)         /* PWM0 signal: PWM0_PWML2 on PB13 mux A */
#define MUX_PB13A_PWM0_PWML2                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PB13A_PWM0_PWML2                       (_UINT32_(1) << 13)  /* PWM0 signal: PWM0_PWML2 */

