zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PD26A_PWM0_PWML2                       _UINT32_(122)        /* PWM0 signal: PWM0_PWML2 on PD26 mux A */
#define MUX_PD26A_PWM0_PWML2                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML2 */
#define PIO_PD26A_PWM0_PWML2                       (_UINT32_(1) << 26)  /* PWM0 signal: PWM0_PWML2 */

#define PIN_PA15C_PWM0_PWML3                       _UINT32_(15)         /* PWM0 signal: PWM0_PWML3 on PA15 mux C */
#define MUX_PA15C_PWM0_PWML3                       _UINT32_(2)          /* PWM0 signal line function value: PWM0_PWML3 */
#define PIO_PA15C_PWM0_PWML3                       (_UINT32_(1) << 15)  /* PWM0 signal: PWM0_PWML3 */

#define PIN_PD27A_PWM0_PWML3                       _UINT32_(123)        /* PWM0 signal: PWM0_PWML3 on PD27 mux A */
#define MUX_PD27A_PWM0_PWML3                       _UINT32_(0)          /* PWM0 signal line function value: PWM0_PWML3 */
#define PIO_PD27A_PWM0_PWML3                       (_UINT32_(1) << 27)  /* PWM0 signal: PWM0_PWML3 */

/* =================== PIO definition for PWM1 peripheral =================== */
#define PIN_PA30B_PWM1_PWMEXTRG0                   _UINT32_(30)         /* PWM1 signal: PWM1_PWMEXTRG0 on PA30 mux B */
#define MUX_PA30B_PWM1_PWMEXTRG0                   _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMEXTRG0 */
#define PIO_PA30B_PWM1_PWMEXTRG0                   (_UINT32_(1) << 30)  /* PWM1 signal: PWM1_PWMEXTRG0 */

#define PIN_PA18A_PWM1_PWMEXTRG1                   _UINT32_(18)         /* PWM1 signal: PWM1_PWMEXTRG1 on PA18 mux A */
#define MUX_PA18A_PWM1_PWMEXTRG1                   _UINT32_(0)          /* PWM1 signal line function value: PWM1_PWMEXTRG1 */
#define PIO_PA18A_PWM1_PWMEXTRG1                   (_UINT32_(1) << 18)  /* PWM1 signal: PWM1_PWMEXTRG1 */

#define PIN_PA21C_PWM1_PWMFI0                      _UINT32_(21)         /* PWM1 signal: PWM1_PWMFI0 on PA21 mux C */
#define MUX_PA21C_PWM1_PWMFI0                      _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWMFI0 */
#define PIO_PA21C_PWM1_PWMFI0                      (_UINT32_(1) << 21)  /* PWM1 signal: PWM1_PWMFI0 */

#define PIN_PA26D_PWM1_PWMFI1                      _UINT32_(26)         /* PWM1 signal: PWM1_PWMFI1 on PA26 mux D */
#define MUX_PA26D_PWM1_PWMFI1                      _UINT32_(3)          /* PWM1 signal line function value: PWM1_PWMFI1 */
#define PIO_PA26D_PWM1_PWMFI1                      (_UINT32_(1) << 26)  /* PWM1 signal: PWM1_PWMFI1 */

#define PIN_PA28D_PWM1_PWMFI2                      _UINT32_(28)         /* PWM1 signal: PWM1_PWMFI2 on PA28 mux D */
#define MUX_PA28D_PWM1_PWMFI2                      _UINT32_(3)          /* PWM1 signal line function value: PWM1_PWMFI2 */
#define PIO_PA28D_PWM1_PWMFI2                      (_UINT32_(1) << 28)  /* PWM1 signal: PWM1_PWMFI2 */

#define PIN_PA12C_PWM1_PWMH0                       _UINT32_(12)         /* PWM1 signal: PWM1_PWMH0 on PA12 mux C */
#define MUX_PA12C_PWM1_PWMH0                       _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWMH0 */
#define PIO_PA12C_PWM1_PWMH0                       (_UINT32_(1) << 12)  /* PWM1 signal: PWM1_PWMH0 */

#define PIN_PD01B_PWM1_PWMH0                       _UINT32_(97)         /* PWM1 signal: PWM1_PWMH0 on PD01 mux B */
#define MUX_PD01B_PWM1_PWMH0                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMH0 */
#define PIO_PD01B_PWM1_PWMH0                       (_UINT32_(1) << 1)   /* PWM1 signal: PWM1_PWMH0 */

#define PIN_PA14C_PWM1_PWMH1                       _UINT32_(14)         /* PWM1 signal: PWM1_PWMH1 on PA14 mux C */
#define MUX_PA14C_PWM1_PWMH1                       _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWMH1 */
#define PIO_PA14C_PWM1_PWMH1                       (_UINT32_(1) << 14)  /* PWM1 signal: PWM1_PWMH1 */

#define PIN_PD03B_PWM1_PWMH1                       _UINT32_(99)         /* PWM1 signal: PWM1_PWMH1 on PD03 mux B */
#define MUX_PD03B_PWM1_PWMH1                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMH1 */
#define PIO_PD03B_PWM1_PWMH1                       (_UINT32_(1) << 3)   /* PWM1 signal: PWM1_PWMH1 */

#define PIN_PA31D_PWM1_PWMH2                       _UINT32_(31)         /* PWM1 signal: PWM1_PWMH2 on PA31 mux D */
#define MUX_PA31D_PWM1_PWMH2                       _UINT32_(3)          /* PWM1 signal line function value: PWM1_PWMH2 */
#define PIO_PA31D_PWM1_PWMH2                       (_UINT32_(1) << 31)  /* PWM1 signal: PWM1_PWMH2 */

#define PIN_PD05B_PWM1_PWMH2                       _UINT32_(101)        /* PWM1 signal: PWM1_PWMH2 on PD05 mux B */
#define MUX_PD05B_PWM1_PWMH2                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMH2 */
#define PIO_PD05B_PWM1_PWMH2                       (_UINT32_(1) << 5)   /* PWM1 signal: PWM1_PWMH2 */

#define PIN_PA08A_PWM1_PWMH3                       _UINT32_(8)          /* PWM1 signal: PWM1_PWMH3 on PA08 mux A */
#define MUX_PA08A_PWM1_PWMH3                       _UINT32_(0)          /* PWM1 signal line function value: PWM1_PWMH3 */
#define PIO_PA08A_PWM1_PWMH3                       (_UINT32_(1) << 8)   /* PWM1 signal: PWM1_PWMH3 */

#define PIN_PD07B_PWM1_PWMH3                       _UINT32_(103)        /* PWM1 signal: PWM1_PWMH3 on PD07 mux B */
#define MUX_PD07B_PWM1_PWMH3                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWMH3 */
#define PIO_PD07B_PWM1_PWMH3                       (_UINT32_(1) << 7)   /* PWM1 signal: PWM1_PWMH3 */

#define PIN_PA11C_PWM1_PWML0                       _UINT32_(11)         /* PWM1 signal: PWM1_PWML0 on PA11 mux C */
#define MUX_PA11C_PWM1_PWML0                       _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWML0 */
#define PIO_PA11C_PWM1_PWML0                       (_UINT32_(1) << 11)  /* PWM1 signal: PWM1_PWML0 */

#define PIN_PD00B_PWM1_PWML0                       _UINT32_(96)         /* PWM1 signal: PWM1_PWML0 on PD00 mux B */
#define MUX_PD00B_PWM1_PWML0                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWML0 */
#define PIO_PD00B_PWM1_PWML0                       (_UINT32_(1) << 0)   /* PWM1 signal: PWM1_PWML0 */

#define PIN_PA13C_PWM1_PWML1                       _UINT32_(13)         /* PWM1 signal: PWM1_PWML1 on PA13 mux C */
#define MUX_PA13C_PWM1_PWML1                       _UINT32_(2)          /* PWM1 signal line function value: PWM1_PWML1 */
#define PIO_PA13C_PWM1_PWML1                       (_UINT32_(1) << 13)  /* PWM1 signal: PWM1_PWML1 */

