zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PD02B_PWM1_PWML1                       _UINT32_(98)         /* PWM1 signal: PWM1_PWML1 on PD02 mux B */
#define MUX_PD02B_PWM1_PWML1                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWML1 */
#define PIO_PD02B_PWM1_PWML1                       (_UINT32_(1) << 2)   /* PWM1 signal: PWM1_PWML1 */

#define PIN_PA23D_PWM1_PWML2                       _UINT32_(23)         /* PWM1 signal: PWM1_PWML2 on PA23 mux D */
#define MUX_PA23D_PWM1_PWML2                       _UINT32_(3)          /* PWM1 signal line function value: PWM1_PWML2 */
#define PIO_PA23D_PWM1_PWML2                       (_UINT32_(1) << 23)  /* PWM1 signal: PWM1_PWML2 */

#define PIN_PD04B_PWM1_PWML2                       _UINT32_(100)        /* PWM1 signal: PWM1_PWML2 on PD04 mux B */
#define MUX_PD04B_PWM1_PWML2                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWML2 */
#define PIO_PD04B_PWM1_PWML2                       (_UINT32_(1) << 4)   /* PWM1 signal: PWM1_PWML2 */

#define PIN_PA05A_PWM1_PWML3                       _UINT32_(5)          /* PWM1 signal: PWM1_PWML3 on PA05 mux A */
#define MUX_PA05A_PWM1_PWML3                       _UINT32_(0)          /* PWM1 signal line function value: PWM1_PWML3 */
#define PIO_PA05A_PWM1_PWML3                       (_UINT32_(1) << 5)   /* PWM1 signal: PWM1_PWML3 */

#define PIN_PD06B_PWM1_PWML3                       _UINT32_(102)        /* PWM1 signal: PWM1_PWML3 on PD06 mux B */
#define MUX_PD06B_PWM1_PWML3                       _UINT32_(1)          /* PWM1 signal line function value: PWM1_PWML3 */
#define PIO_PD06B_PWM1_PWML3                       (_UINT32_(1) << 6)   /* PWM1 signal: PWM1_PWML3 */

/* =================== PIO definition for QSPI peripheral =================== */
#define PIN_PA11A_QSPI_QCS                         _UINT32_(11)         /* QSPI signal: QSPI_QCS on PA11 mux A */
#define MUX_PA11A_QSPI_QCS                         _UINT32_(0)          /* QSPI signal line function value: QSPI_QCS */
#define PIO_PA11A_QSPI_QCS                         (_UINT32_(1) << 11)  /* QSPI signal: QSPI_QCS */

#define PIN_PA13A_QSPI_QIO0                        _UINT32_(13)         /* QSPI signal: QSPI_QIO0 on PA13 mux A */
#define MUX_PA13A_QSPI_QIO0                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QIO0 */
#define PIO_PA13A_QSPI_QIO0                        (_UINT32_(1) << 13)  /* QSPI signal: QSPI_QIO0 */

#define PIN_PA12A_QSPI_QIO1                        _UINT32_(12)         /* QSPI signal: QSPI_QIO1 on PA12 mux A */
#define MUX_PA12A_QSPI_QIO1                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QIO1 */
#define PIO_PA12A_QSPI_QIO1                        (_UINT32_(1) << 12)  /* QSPI signal: QSPI_QIO1 */

#define PIN_PA17A_QSPI_QIO2                        _UINT32_(17)         /* QSPI signal: QSPI_QIO2 on PA17 mux A */
#define MUX_PA17A_QSPI_QIO2                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QIO2 */
#define PIO_PA17A_QSPI_QIO2                        (_UINT32_(1) << 17)  /* QSPI signal: QSPI_QIO2 */

#define PIN_PD31A_QSPI_QIO3                        _UINT32_(127)        /* QSPI signal: QSPI_QIO3 on PD31 mux A */
#define MUX_PD31A_QSPI_QIO3                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QIO3 */
#define PIO_PD31A_QSPI_QIO3                        (_UINT32_(1) << 31)  /* QSPI signal: QSPI_QIO3 */

#define PIN_PA14A_QSPI_QSCK                        _UINT32_(14)         /* QSPI signal: QSPI_QSCK on PA14 mux A */
#define MUX_PA14A_QSPI_QSCK                        _UINT32_(0)          /* QSPI signal line function value: QSPI_QSCK */
#define PIO_PA14A_QSPI_QSCK                        (_UINT32_(1) << 14)  /* QSPI signal: QSPI_QSCK */

/* =================== PIO definition for RTC peripheral ==================== */
#define PIN_PB00X1_RTC_RTCOUT0                     _UINT32_(32)         /* RTC signal: RTC_RTCOUT0 on PB00 mux X1 */
#define PIO_PB00X1_RTC_RTCOUT0                     (_UINT32_(1) << 0)   /* RTC signal: RTC_RTCOUT0 */

#define PIN_PB01X1_RTC_RTCOUT1                     _UINT32_(33)         /* RTC signal: RTC_RTCOUT1 on PB01 mux X1 */
#define PIO_PB01X1_RTC_RTCOUT1                     (_UINT32_(1) << 1)   /* RTC signal: RTC_RTCOUT1 */

/* =================== PIO definition for SPI0 peripheral =================== */
#define PIN_PD20B_SPI0_MISO                        _UINT32_(116)        /* SPI0 signal: SPI0_MISO on PD20 mux B */
#define MUX_PD20B_SPI0_MISO                        _UINT32_(1)          /* SPI0 signal line function value: SPI0_MISO */
#define PIO_PD20B_SPI0_MISO                        (_UINT32_(1) << 20)  /* SPI0 signal: SPI0_MISO */

#define PIN_PD21B_SPI0_MOSI                        _UINT32_(117)        /* SPI0 signal: SPI0_MOSI on PD21 mux B */
#define MUX_PD21B_SPI0_MOSI                        _UINT32_(1)          /* SPI0 signal line function value: SPI0_MOSI */
#define PIO_PD21B_SPI0_MOSI                        (_UINT32_(1) << 21)  /* SPI0 signal: SPI0_MOSI */

#define PIN_PB02D_SPI0_NPCS0                       _UINT32_(34)         /* SPI0 signal: SPI0_NPCS0 on PB02 mux D */
#define MUX_PB02D_SPI0_NPCS0                       _UINT32_(3)          /* SPI0 signal line function value: SPI0_NPCS0 */
#define PIO_PB02D_SPI0_NPCS0                       (_UINT32_(1) << 2)   /* SPI0 signal: SPI0_NPCS0 */

#define PIN_PA31A_SPI0_NPCS1                       _UINT32_(31)         /* SPI0 signal: SPI0_NPCS1 on PA31 mux A */
#define MUX_PA31A_SPI0_NPCS1                       _UINT32_(0)          /* SPI0 signal line function value: SPI0_NPCS1 */
#define PIO_PA31A_SPI0_NPCS1                       (_UINT32_(1) << 31)  /* SPI0 signal: SPI0_NPCS1 */

#define PIN_PD25B_SPI0_NPCS1                       _UINT32_(121)        /* SPI0 signal: SPI0_NPCS1 on PD25 mux B */
#define MUX_PD25B_SPI0_NPCS1                       _UINT32_(1)          /* SPI0 signal line function value: SPI0_NPCS1 */
#define PIO_PD25B_SPI0_NPCS1                       (_UINT32_(1) << 25)  /* SPI0 signal: SPI0_NPCS1 */

#define PIN_PD12C_SPI0_NPCS2                       _UINT32_(108)        /* SPI0 signal: SPI0_NPCS2 on PD12 mux C */
#define MUX_PD12C_SPI0_NPCS2                       _UINT32_(2)          /* SPI0 signal line function value: SPI0_NPCS2 */
#define PIO_PD12C_SPI0_NPCS2                       (_UINT32_(1) << 12)  /* SPI0 signal: SPI0_NPCS2 */

