zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PD27B_SPI0_NPCS3                       _UINT32_(123)        /* SPI0 signal: SPI0_NPCS3 on PD27 mux B */
#define MUX_PD27B_SPI0_NPCS3                       _UINT32_(1)          /* SPI0 signal line function value: SPI0_NPCS3 */
#define PIO_PD27B_SPI0_NPCS3                       (_UINT32_(1) << 27)  /* SPI0 signal: SPI0_NPCS3 */

#define PIN_PD22B_SPI0_SPCK                        _UINT32_(118)        /* SPI0 signal: SPI0_SPCK on PD22 mux B */
#define MUX_PD22B_SPI0_SPCK                        _UINT32_(1)          /* SPI0 signal line function value: SPI0_SPCK */
#define PIO_PD22B_SPI0_SPCK                        (_UINT32_(1) << 22)  /* SPI0 signal: SPI0_SPCK */

/* =================== PIO definition for SSC peripheral ==================== */
#define PIN_PA10C_SSC_RD                           _UINT32_(10)         /* SSC signal: SSC_RD on PA10 mux C */
#define MUX_PA10C_SSC_RD                           _UINT32_(2)          /* SSC signal line function value: SSC_RD */
#define PIO_PA10C_SSC_RD                           (_UINT32_(1) << 10)  /* SSC signal: SSC_RD */

#define PIN_PD24B_SSC_RF                           _UINT32_(120)        /* SSC signal: SSC_RF on PD24 mux B */
#define MUX_PD24B_SSC_RF                           _UINT32_(1)          /* SSC signal line function value: SSC_RF */
#define PIO_PD24B_SSC_RF                           (_UINT32_(1) << 24)  /* SSC signal: SSC_RF */

#define PIN_PA22A_SSC_RK                           _UINT32_(22)         /* SSC signal: SSC_RK on PA22 mux A */
#define MUX_PA22A_SSC_RK                           _UINT32_(0)          /* SSC signal line function value: SSC_RK */
#define PIO_PA22A_SSC_RK                           (_UINT32_(1) << 22)  /* SSC signal: SSC_RK */

#define PIN_PB05D_SSC_TD                           _UINT32_(37)         /* SSC signal: SSC_TD on PB05 mux D */
#define MUX_PB05D_SSC_TD                           _UINT32_(3)          /* SSC signal line function value: SSC_TD */
#define PIO_PB05D_SSC_TD                           (_UINT32_(1) << 5)   /* SSC signal: SSC_TD */

#define PIN_PD10C_SSC_TD                           _UINT32_(106)        /* SSC signal: SSC_TD on PD10 mux C */
#define MUX_PD10C_SSC_TD                           _UINT32_(2)          /* SSC signal line function value: SSC_TD */
#define PIO_PD10C_SSC_TD                           (_UINT32_(1) << 10)  /* SSC signal: SSC_TD */

#define PIN_PD26B_SSC_TD                           _UINT32_(122)        /* SSC signal: SSC_TD on PD26 mux B */
#define MUX_PD26B_SSC_TD                           _UINT32_(1)          /* SSC signal line function value: SSC_TD */
#define PIO_PD26B_SSC_TD                           (_UINT32_(1) << 26)  /* SSC signal: SSC_TD */

#define PIN_PB00D_SSC_TF                           _UINT32_(32)         /* SSC signal: SSC_TF on PB00 mux D */
#define MUX_PB00D_SSC_TF                           _UINT32_(3)          /* SSC signal line function value: SSC_TF */
#define PIO_PB00D_SSC_TF                           (_UINT32_(1) << 0)   /* SSC signal: SSC_TF */

#define PIN_PB01D_SSC_TK                           _UINT32_(33)         /* SSC signal: SSC_TK on PB01 mux D */
#define MUX_PB01D_SSC_TK                           _UINT32_(3)          /* SSC signal line function value: SSC_TK */
#define PIO_PB01D_SSC_TK                           (_UINT32_(1) << 1)   /* SSC signal: SSC_TK */

/* =================== PIO definition for SUPC peripheral =================== */
#define PIN_PA00X1_SUPC_WKUP0                      _UINT32_(0)          /* SUPC signal: SUPC_WKUP0 on PA00 mux X1 */
#define PIO_PA00X1_SUPC_WKUP0                      (_UINT32_(1) << 0)   /* SUPC signal: SUPC_WKUP0 */

#define PIN_PA01X1_SUPC_WKUP1                      _UINT32_(1)          /* SUPC signal: SUPC_WKUP1 on PA01 mux X1 */
#define PIO_PA01X1_SUPC_WKUP1                      (_UINT32_(1) << 1)   /* SUPC signal: SUPC_WKUP1 */

#define PIN_PA02X1_SUPC_WKUP2                      _UINT32_(2)          /* SUPC signal: SUPC_WKUP2 on PA02 mux X1 */
#define PIO_PA02X1_SUPC_WKUP2                      (_UINT32_(1) << 2)   /* SUPC signal: SUPC_WKUP2 */

#define PIN_PA04X1_SUPC_WKUP3                      _UINT32_(4)          /* SUPC signal: SUPC_WKUP3 on PA04 mux X1 */
#define PIO_PA04X1_SUPC_WKUP3                      (_UINT32_(1) << 4)   /* SUPC signal: SUPC_WKUP3 */

#define PIN_PA05X1_SUPC_WKUP4                      _UINT32_(5)          /* SUPC signal: SUPC_WKUP4 on PA05 mux X1 */
#define PIO_PA05X1_SUPC_WKUP4                      (_UINT32_(1) << 5)   /* SUPC signal: SUPC_WKUP4 */

#define PIN_PD28X1_SUPC_WKUP5                      _UINT32_(124)        /* SUPC signal: SUPC_WKUP5 on PD28 mux X1 */
#define PIO_PD28X1_SUPC_WKUP5                      (_UINT32_(1) << 28)  /* SUPC signal: SUPC_WKUP5 */

#define PIN_PA09X1_SUPC_WKUP6                      _UINT32_(9)          /* SUPC signal: SUPC_WKUP6 on PA09 mux X1 */
#define PIO_PA09X1_SUPC_WKUP6                      (_UINT32_(1) << 9)   /* SUPC signal: SUPC_WKUP6 */

#define PIN_PA11X1_SUPC_WKUP7                      _UINT32_(11)         /* SUPC signal: SUPC_WKUP7 on PA11 mux X1 */
#define PIO_PA11X1_SUPC_WKUP7                      (_UINT32_(1) << 11)  /* SUPC signal: SUPC_WKUP7 */

#define PIN_PA14X1_SUPC_WKUP8                      _UINT32_(14)         /* SUPC signal: SUPC_WKUP8 on PA14 mux X1 */
#define PIO_PA14X1_SUPC_WKUP8                      (_UINT32_(1) << 14)  /* SUPC signal: SUPC_WKUP8 */

#define PIN_PA19X1_SUPC_WKUP9                      _UINT32_(19)         /* SUPC signal: SUPC_WKUP9 on PA19 mux X1 */
#define PIO_PA19X1_SUPC_WKUP9                      (_UINT32_(1) << 19)  /* SUPC signal: SUPC_WKUP9 */

#define PIN_PA20X1_SUPC_WKUP10                     _UINT32_(20)         /* SUPC signal: SUPC_WKUP10 on PA20 mux X1 */
#define PIO_PA20X1_SUPC_WKUP10                     (_UINT32_(1) << 20)  /* SUPC signal: SUPC_WKUP10 */

#define PIN_PA30X1_SUPC_WKUP11                     _UINT32_(30)         /* SUPC signal: SUPC_WKUP11 on PA30 mux X1 */
#define PIO_PA30X1_SUPC_WKUP11                     (_UINT32_(1) << 30)  /* SUPC signal: SUPC_WKUP11 */

