zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PB03X1_SUPC_WKUP12                     _UINT32_(35)         /* SUPC signal: SUPC_WKUP12 on PB03 mux X1 */
#define PIO_PB03X1_SUPC_WKUP12                     (_UINT32_(1) << 3)   /* SUPC signal: SUPC_WKUP12 */

#define PIN_PB05X1_SUPC_WKUP13                     _UINT32_(37)         /* SUPC signal: SUPC_WKUP13 on PB05 mux X1 */
#define PIO_PB05X1_SUPC_WKUP13                     (_UINT32_(1) << 5)   /* SUPC signal: SUPC_WKUP13 */

/* =================== PIO definition for TC0 peripheral ==================== */
#define PIN_PA04B_TC0_TCLK0                        _UINT32_(4)          /* TC0 signal: TC0_TCLK0 on PA04 mux B */
#define MUX_PA04B_TC0_TCLK0                        _UINT32_(1)          /* TC0 signal line function value: TC0_TCLK0 */
#define PIO_PA04B_TC0_TCLK0                        (_UINT32_(1) << 4)   /* TC0 signal: TC0_TCLK0 */

#define PIN_PA28B_TC0_TCLK1                        _UINT32_(28)         /* TC0 signal: TC0_TCLK1 on PA28 mux B */
#define MUX_PA28B_TC0_TCLK1                        _UINT32_(1)          /* TC0 signal line function value: TC0_TCLK1 */
#define PIO_PA28B_TC0_TCLK1                        (_UINT32_(1) << 28)  /* TC0 signal: TC0_TCLK1 */

#define PIN_PA00B_TC0_TIOA0                        _UINT32_(0)          /* TC0 signal: TC0_TIOA0 on PA00 mux B */
#define MUX_PA00B_TC0_TIOA0                        _UINT32_(1)          /* TC0 signal line function value: TC0_TIOA0 */
#define PIO_PA00B_TC0_TIOA0                        (_UINT32_(1) << 0)   /* TC0 signal: TC0_TIOA0 */

#define PIN_PA15B_TC0_TIOA1                        _UINT32_(15)         /* TC0 signal: TC0_TIOA1 on PA15 mux B */
#define MUX_PA15B_TC0_TIOA1                        _UINT32_(1)          /* TC0 signal line function value: TC0_TIOA1 */
#define PIO_PA15B_TC0_TIOA1                        (_UINT32_(1) << 15)  /* TC0 signal: TC0_TIOA1 */

#define PIN_PA26B_TC0_TIOA2                        _UINT32_(26)         /* TC0 signal: TC0_TIOA2 on PA26 mux B */
#define MUX_PA26B_TC0_TIOA2                        _UINT32_(1)          /* TC0 signal line function value: TC0_TIOA2 */
#define PIO_PA26B_TC0_TIOA2                        (_UINT32_(1) << 26)  /* TC0 signal: TC0_TIOA2 */

#define PIN_PA01B_TC0_TIOB0                        _UINT32_(1)          /* TC0 signal: TC0_TIOB0 on PA01 mux B */
#define MUX_PA01B_TC0_TIOB0                        _UINT32_(1)          /* TC0 signal line function value: TC0_TIOB0 */
#define PIO_PA01B_TC0_TIOB0                        (_UINT32_(1) << 1)   /* TC0 signal: TC0_TIOB0 */

#define PIN_PA16B_TC0_TIOB1                        _UINT32_(16)         /* TC0 signal: TC0_TIOB1 on PA16 mux B */
#define MUX_PA16B_TC0_TIOB1                        _UINT32_(1)          /* TC0 signal line function value: TC0_TIOB1 */
#define PIO_PA16B_TC0_TIOB1                        (_UINT32_(1) << 16)  /* TC0 signal: TC0_TIOB1 */

#define PIN_PA27B_TC0_TIOB2                        _UINT32_(27)         /* TC0 signal: TC0_TIOB2 on PA27 mux B */
#define MUX_PA27B_TC0_TIOB2                        _UINT32_(1)          /* TC0 signal line function value: TC0_TIOB2 */
#define PIO_PA27B_TC0_TIOB2                        (_UINT32_(1) << 27)  /* TC0 signal: TC0_TIOB2 */

/* =================== PIO definition for TC3 peripheral ==================== */
#define PIN_PD24C_TC3_TCLK11                       _UINT32_(120)        /* TC3 signal: TC3_TCLK11 on PD24 mux C */
#define MUX_PD24C_TC3_TCLK11                       _UINT32_(2)          /* TC3 signal line function value: TC3_TCLK11 */
#define PIO_PD24C_TC3_TCLK11                       (_UINT32_(1) << 24)  /* TC3 signal: TC3_TCLK11 */

#define PIN_PD21C_TC3_TIOA11                       _UINT32_(117)        /* TC3 signal: TC3_TIOA11 on PD21 mux C */
#define MUX_PD21C_TC3_TIOA11                       _UINT32_(2)          /* TC3 signal line function value: TC3_TIOA11 */
#define PIO_PD21C_TC3_TIOA11                       (_UINT32_(1) << 21)  /* TC3 signal: TC3_TIOA11 */

#define PIN_PD22C_TC3_TIOB11                       _UINT32_(118)        /* TC3 signal: TC3_TIOB11 on PD22 mux C */
#define MUX_PD22C_TC3_TIOB11                       _UINT32_(2)          /* TC3 signal line function value: TC3_TIOB11 */
#define PIO_PD22C_TC3_TIOB11                       (_UINT32_(1) << 22)  /* TC3 signal: TC3_TIOB11 */

/* ================== PIO definition for TWIHS0 peripheral ================== */
#define PIN_PA04A_TWIHS0_TWCK0                     _UINT32_(4)          /* TWIHS0 signal: TWIHS0_TWCK0 on PA04 mux A */
#define MUX_PA04A_TWIHS0_TWCK0                     _UINT32_(0)          /* TWIHS0 signal line function value: TWIHS0_TWCK0 */
#define PIO_PA04A_TWIHS0_TWCK0                     (_UINT32_(1) << 4)   /* TWIHS0 signal: TWIHS0_TWCK0 */

#define PIN_PA03A_TWIHS0_TWD0                      _UINT32_(3)          /* TWIHS0 signal: TWIHS0_TWD0 on PA03 mux A */
#define MUX_PA03A_TWIHS0_TWD0                      _UINT32_(0)          /* TWIHS0 signal line function value: TWIHS0_TWD0 */
#define PIO_PA03A_TWIHS0_TWD0                      (_UINT32_(1) << 3)   /* TWIHS0 signal: TWIHS0_TWD0 */

/* ================== PIO definition for TWIHS1 peripheral ================== */
#define PIN_PB05A_TWIHS1_TWCK1                     _UINT32_(37)         /* TWIHS1 signal: TWIHS1_TWCK1 on PB05 mux A */
#define MUX_PB05A_TWIHS1_TWCK1                     _UINT32_(0)          /* TWIHS1 signal line function value: TWIHS1_TWCK1 */
#define PIO_PB05A_TWIHS1_TWCK1                     (_UINT32_(1) << 5)   /* TWIHS1 signal: TWIHS1_TWCK1 */

#define PIN_PB04A_TWIHS1_TWD1                      _UINT32_(36)         /* TWIHS1 signal: TWIHS1_TWD1 on PB04 mux A */
#define MUX_PB04A_TWIHS1_TWD1                      _UINT32_(0)          /* TWIHS1 signal line function value: TWIHS1_TWD1 */
#define PIO_PB04A_TWIHS1_TWD1                      (_UINT32_(1) << 4)   /* TWIHS1 signal: TWIHS1_TWD1 */

/* ================== PIO definition for TWIHS2 peripheral ================== */
#define PIN_PD28C_TWIHS2_TWCK2                     _UINT32_(124)        /* TWIHS2 signal: TWIHS2_TWCK2 on PD28 mux C */
#define MUX_PD28C_TWIHS2_TWCK2                     _UINT32_(2)          /* TWIHS2 signal line function value: TWIHS2_TWCK2 */
#define PIO_PD28C_TWIHS2_TWCK2                     (_UINT32_(1) << 28)  /* TWIHS2 signal: TWIHS2_TWCK2 */

#define PIN_PD27C_TWIHS2_TWD2                      _UINT32_(123)        /* TWIHS2 signal: TWIHS2_TWD2 on PD27 mux C */
#define MUX_PD27C_TWIHS2_TWD2                      _UINT32_(2)          /* TWIHS2 signal line function value: TWIHS2_TWD2 */
#define PIO_PD27C_TWIHS2_TWD2                      (_UINT32_(1) << 27)  /* TWIHS2 signal: TWIHS2_TWD2 */

/* ================== PIO definition for UART0 peripheral =================== */
#define PIN_PA09A_UART0_URXD0                      _UINT32_(9)          /* UART0 signal: UART0_URXD0 on PA09 mux A */
#define MUX_PA09A_UART0_URXD0                      _UINT32_(0)          /* UART0 signal line function value: UART0_URXD0 */
#define PIO_PA09A_UART0_URXD0                      (_UINT32_(1) << 9)   /* UART0 signal: UART0_URXD0 */

#define PIN_PA10A_UART0_UTXD0                      _UINT32_(10)         /* UART0 signal: UART0_UTXD0 on PA10 mux A */
#define MUX_PA10A_UART0_UTXD0                      _UINT32_(0)          /* UART0 signal line function value: UART0_UTXD0 */
#define PIO_PA10A_UART0_UTXD0                      (_UINT32_(1) << 10)  /* UART0 signal: UART0_UTXD0 */

/* ================== PIO definition for UART1 peripheral =================== */
#define PIN_PA05C_UART1_URXD1                      _UINT32_(5)          /* UART1 signal: UART1_URXD1 on PA05 mux C */
#define MUX_PA05C_UART1_URXD1                      _UINT32_(2)          /* UART1 signal line function value: UART1_URXD1 */
#define PIO_PA05C_UART1_URXD1                      (_UINT32_(1) << 5)   /* UART1 signal: UART1_URXD1 */

#define PIN_PA04C_UART1_UTXD1                      _UINT32_(4)          /* UART1 signal: UART1_UTXD1 on PA04 mux C */
#define MUX_PA04C_UART1_UTXD1                      _UINT32_(2)          /* UART1 signal line function value: UART1_UTXD1 */
#define PIO_PA04C_UART1_UTXD1                      (_UINT32_(1) << 4)   /* UART1 signal: UART1_UTXD1 */

