zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PA06C_UART1_UTXD1                      _UINT32_(6)          /* UART1 signal: UART1_UTXD1 on PA06 mux C */
#define MUX_PA06C_UART1_UTXD1                      _UINT32_(2)          /* UART1 signal line function value: UART1_UTXD1 */
#define PIO_PA06C_UART1_UTXD1                      (_UINT32_(1) << 6)   /* UART1 signal: UART1_UTXD1 */

#define PIN_PD26D_UART1_UTXD1                      _UINT32_(122)        /* UART1 signal: UART1_UTXD1 on PD26 mux D */
#define MUX_PD26D_UART1_UTXD1                      _UINT32_(3)          /* UART1 signal line function value: UART1_UTXD1 */
#define PIO_PD26D_UART1_UTXD1                      (_UINT32_(1) << 26)  /* UART1 signal: UART1_UTXD1 */

/* ================== PIO definition for UART2 peripheral =================== */
#define PIN_PD25C_UART2_URXD2                      _UINT32_(121)        /* UART2 signal: UART2_URXD2 on PD25 mux C */
#define MUX_PD25C_UART2_URXD2                      _UINT32_(2)          /* UART2 signal line function value: UART2_URXD2 */
#define PIO_PD25C_UART2_URXD2                      (_UINT32_(1) << 25)  /* UART2 signal: UART2_URXD2 */

#define PIN_PD26C_UART2_UTXD2                      _UINT32_(122)        /* UART2 signal: UART2_UTXD2 on PD26 mux C */
#define MUX_PD26C_UART2_UTXD2                      _UINT32_(2)          /* UART2 signal line function value: UART2_UTXD2 */
#define PIO_PD26C_UART2_UTXD2                      (_UINT32_(1) << 26)  /* UART2 signal: UART2_UTXD2 */

/* ================== PIO definition for UART3 peripheral =================== */
#define PIN_PD28A_UART3_URXD3                      _UINT32_(124)        /* UART3 signal: UART3_URXD3 on PD28 mux A */
#define MUX_PD28A_UART3_URXD3                      _UINT32_(0)          /* UART3 signal line function value: UART3_URXD3 */
#define PIO_PD28A_UART3_URXD3                      (_UINT32_(1) << 28)  /* UART3 signal: UART3_URXD3 */

#define PIN_PD30A_UART3_UTXD3                      _UINT32_(126)        /* UART3 signal: UART3_UTXD3 on PD30 mux A */
#define MUX_PD30A_UART3_UTXD3                      _UINT32_(0)          /* UART3 signal line function value: UART3_UTXD3 */
#define PIO_PD30A_UART3_UTXD3                      (_UINT32_(1) << 30)  /* UART3 signal: UART3_UTXD3 */

#define PIN_PD31B_UART3_UTXD3                      _UINT32_(127)        /* UART3 signal: UART3_UTXD3 on PD31 mux B */
#define MUX_PD31B_UART3_UTXD3                      _UINT32_(1)          /* UART3 signal line function value: UART3_UTXD3 */
#define PIO_PD31B_UART3_UTXD3                      (_UINT32_(1) << 31)  /* UART3 signal: UART3_UTXD3 */

/* ================== PIO definition for UART4 peripheral =================== */
#define PIN_PD18C_UART4_URXD4                      _UINT32_(114)        /* UART4 signal: UART4_URXD4 on PD18 mux C */
#define MUX_PD18C_UART4_URXD4                      _UINT32_(2)          /* UART4 signal line function value: UART4_URXD4 */
#define PIO_PD18C_UART4_URXD4                      (_UINT32_(1) << 18)  /* UART4 signal: UART4_URXD4 */

#define PIN_PD03C_UART4_UTXD4                      _UINT32_(99)         /* UART4 signal: UART4_UTXD4 on PD03 mux C */
#define MUX_PD03C_UART4_UTXD4                      _UINT32_(2)          /* UART4 signal line function value: UART4_UTXD4 */
#define PIO_PD03C_UART4_UTXD4                      (_UINT32_(1) << 3)   /* UART4 signal: UART4_UTXD4 */

#define PIN_PD19C_UART4_UTXD4                      _UINT32_(115)        /* UART4 signal: UART4_UTXD4 on PD19 mux C */
#define MUX_PD19C_UART4_UTXD4                      _UINT32_(2)          /* UART4 signal line function value: UART4_UTXD4 */
#define PIO_PD19C_UART4_UTXD4                      (_UINT32_(1) << 19)  /* UART4 signal: UART4_UTXD4 */

/* ================== PIO definition for USART0 peripheral ================== */
#define PIN_PB02C_USART0_CTS0                      _UINT32_(34)         /* USART0 signal: USART0_CTS0 on PB02 mux C */
#define MUX_PB02C_USART0_CTS0                      _UINT32_(2)          /* USART0 signal line function value: USART0_CTS0 */
#define PIO_PB02C_USART0_CTS0                      (_UINT32_(1) << 2)   /* USART0 signal: USART0_CTS0 */

#define PIN_PD00D_USART0_DCD0                      _UINT32_(96)         /* USART0 signal: USART0_DCD0 on PD00 mux D */
#define MUX_PD00D_USART0_DCD0                      _UINT32_(3)          /* USART0 signal line function value: USART0_DCD0 */
#define PIO_PD00D_USART0_DCD0                      (_UINT32_(1) << 0)   /* USART0 signal: USART0_DCD0 */

#define PIN_PD02D_USART0_DSR0                      _UINT32_(98)         /* USART0 signal: USART0_DSR0 on PD02 mux D */
#define MUX_PD02D_USART0_DSR0                      _UINT32_(3)          /* USART0 signal line function value: USART0_DSR0 */
#define PIO_PD02D_USART0_DSR0                      (_UINT32_(1) << 2)   /* USART0 signal: USART0_DSR0 */

#define PIN_PD01D_USART0_DTR0                      _UINT32_(97)         /* USART0 signal: USART0_DTR0 on PD01 mux D */
#define MUX_PD01D_USART0_DTR0                      _UINT32_(3)          /* USART0 signal line function value: USART0_DTR0 */
#define PIO_PD01D_USART0_DTR0                      (_UINT32_(1) << 1)   /* USART0 signal: USART0_DTR0 */

#define PIN_PD03D_USART0_RI0                       _UINT32_(99)         /* USART0 signal: USART0_RI0 on PD03 mux D */
#define MUX_PD03D_USART0_RI0                       _UINT32_(3)          /* USART0 signal line function value: USART0_RI0 */
#define PIO_PD03D_USART0_RI0                       (_UINT32_(1) << 3)   /* USART0 signal: USART0_RI0 */

#define PIN_PB03C_USART0_RTS0                      _UINT32_(35)         /* USART0 signal: USART0_RTS0 on PB03 mux C */
#define MUX_PB03C_USART0_RTS0                      _UINT32_(2)          /* USART0 signal line function value: USART0_RTS0 */
#define PIO_PB03C_USART0_RTS0                      (_UINT32_(1) << 3)   /* USART0 signal: USART0_RTS0 */

#define PIN_PB00C_USART0_RXD0                      _UINT32_(32)         /* USART0 signal: USART0_RXD0 on PB00 mux C */
#define MUX_PB00C_USART0_RXD0                      _UINT32_(2)          /* USART0 signal line function value: USART0_RXD0 */
#define PIO_PB00C_USART0_RXD0                      (_UINT32_(1) << 0)   /* USART0 signal: USART0_RXD0 */

