zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PB13C_USART0_SCK0                      _UINT32_(45)         /* USART0 signal: USART0_SCK0 on PB13 mux C */
#define MUX_PB13C_USART0_SCK0                      _UINT32_(2)          /* USART0 signal line function value: USART0_SCK0 */
#define PIO_PB13C_USART0_SCK0                      (_UINT32_(1) << 13)  /* USART0 signal: USART0_SCK0 */

#define PIN_PB01C_USART0_TXD0                      _UINT32_(33)         /* USART0 signal: USART0_TXD0 on PB01 mux C */
#define MUX_PB01C_USART0_TXD0                      _UINT32_(2)          /* USART0 signal line function value: USART0_TXD0 */
#define PIO_PB01C_USART0_TXD0                      (_UINT32_(1) << 1)   /* USART0 signal: USART0_TXD0 */

/* ================== PIO definition for USART1 peripheral ================== */
#define PIN_PA25A_USART1_CTS1                      _UINT32_(25)         /* USART1 signal: USART1_CTS1 on PA25 mux A */
#define MUX_PA25A_USART1_CTS1                      _UINT32_(0)          /* USART1 signal line function value: USART1_CTS1 */
#define PIO_PA25A_USART1_CTS1                      (_UINT32_(1) << 25)  /* USART1 signal: USART1_CTS1 */

#define PIN_PA26A_USART1_DCD1                      _UINT32_(26)         /* USART1 signal: USART1_DCD1 on PA26 mux A */
#define MUX_PA26A_USART1_DCD1                      _UINT32_(0)          /* USART1 signal line function value: USART1_DCD1 */
#define PIO_PA26A_USART1_DCD1                      (_UINT32_(1) << 26)  /* USART1 signal: USART1_DCD1 */

#define PIN_PA28A_USART1_DSR1                      _UINT32_(28)         /* USART1 signal: USART1_DSR1 on PA28 mux A */
#define MUX_PA28A_USART1_DSR1                      _UINT32_(0)          /* USART1 signal line function value: USART1_DSR1 */
#define PIO_PA28A_USART1_DSR1                      (_UINT32_(1) << 28)  /* USART1 signal: USART1_DSR1 */

#define PIN_PA27A_USART1_DTR1                      _UINT32_(27)         /* USART1 signal: USART1_DTR1 on PA27 mux A */
#define MUX_PA27A_USART1_DTR1                      _UINT32_(0)          /* USART1 signal line function value: USART1_DTR1 */
#define PIO_PA27A_USART1_DTR1                      (_UINT32_(1) << 27)  /* USART1 signal: USART1_DTR1 */

#define PIN_PA03B_USART1_LONCOL1                   _UINT32_(3)          /* USART1 signal: USART1_LONCOL1 on PA03 mux B */
#define MUX_PA03B_USART1_LONCOL1                   _UINT32_(1)          /* USART1 signal line function value: USART1_LONCOL1 */
#define PIO_PA03B_USART1_LONCOL1                   (_UINT32_(1) << 3)   /* USART1 signal: USART1_LONCOL1 */

#define PIN_PA29A_USART1_RI1                       _UINT32_(29)         /* USART1 signal: USART1_RI1 on PA29 mux A */
#define MUX_PA29A_USART1_RI1                       _UINT32_(0)          /* USART1 signal line function value: USART1_RI1 */
#define PIO_PA29A_USART1_RI1                       (_UINT32_(1) << 29)  /* USART1 signal: USART1_RI1 */

#define PIN_PA24A_USART1_RTS1                      _UINT32_(24)         /* USART1 signal: USART1_RTS1 on PA24 mux A */
#define MUX_PA24A_USART1_RTS1                      _UINT32_(0)          /* USART1 signal line function value: USART1_RTS1 */
#define PIO_PA24A_USART1_RTS1                      (_UINT32_(1) << 24)  /* USART1 signal: USART1_RTS1 */

#define PIN_PA21A_USART1_RXD1                      _UINT32_(21)         /* USART1 signal: USART1_RXD1 on PA21 mux A */
#define MUX_PA21A_USART1_RXD1                      _UINT32_(0)          /* USART1 signal line function value: USART1_RXD1 */
#define PIO_PA21A_USART1_RXD1                      (_UINT32_(1) << 21)  /* USART1 signal: USART1_RXD1 */

#define PIN_PA23A_USART1_SCK1                      _UINT32_(23)         /* USART1 signal: USART1_SCK1 on PA23 mux A */
#define MUX_PA23A_USART1_SCK1                      _UINT32_(0)          /* USART1 signal line function value: USART1_SCK1 */
#define PIO_PA23A_USART1_SCK1                      (_UINT32_(1) << 23)  /* USART1 signal: USART1_SCK1 */

#define PIN_PB04D_USART1_TXD1                      _UINT32_(36)         /* USART1 signal: USART1_TXD1 on PB04 mux D */
#define MUX_PB04D_USART1_TXD1                      _UINT32_(3)          /* USART1 signal line function value: USART1_TXD1 */
#define PIO_PB04D_USART1_TXD1                      (_UINT32_(1) << 4)   /* USART1 signal: USART1_TXD1 */

/* ================== PIO definition for USART2 peripheral ================== */
#define PIN_PD19B_USART2_CTS2                      _UINT32_(115)        /* USART2 signal: USART2_CTS2 on PD19 mux B */
#define MUX_PD19B_USART2_CTS2                      _UINT32_(1)          /* USART2 signal line function value: USART2_CTS2 */
#define PIO_PD19B_USART2_CTS2                      (_UINT32_(1) << 19)  /* USART2 signal: USART2_CTS2 */

#define PIN_PD04D_USART2_DCD2                      _UINT32_(100)        /* USART2 signal: USART2_DCD2 on PD04 mux D */
#define MUX_PD04D_USART2_DCD2                      _UINT32_(3)          /* USART2 signal line function value: USART2_DCD2 */
#define PIO_PD04D_USART2_DCD2                      (_UINT32_(1) << 4)   /* USART2 signal: USART2_DCD2 */

#define PIN_PD06D_USART2_DSR2                      _UINT32_(102)        /* USART2 signal: USART2_DSR2 on PD06 mux D */
#define MUX_PD06D_USART2_DSR2                      _UINT32_(3)          /* USART2 signal line function value: USART2_DSR2 */
#define PIO_PD06D_USART2_DSR2                      (_UINT32_(1) << 6)   /* USART2 signal: USART2_DSR2 */

#define PIN_PD05D_USART2_DTR2                      _UINT32_(101)        /* USART2 signal: USART2_DTR2 on PD05 mux D */
#define MUX_PD05D_USART2_DTR2                      _UINT32_(3)          /* USART2 signal line function value: USART2_DTR2 */
#define PIO_PD05D_USART2_DTR2                      (_UINT32_(1) << 5)   /* USART2 signal: USART2_DTR2 */

#define PIN_PD07D_USART2_RI2                       _UINT32_(103)        /* USART2 signal: USART2_RI2 on PD07 mux D */
#define MUX_PD07D_USART2_RI2                       _UINT32_(3)          /* USART2 signal line function value: USART2_RI2 */
#define PIO_PD07D_USART2_RI2                       (_UINT32_(1) << 7)   /* USART2 signal: USART2_RI2 */

