zephyrproject-rtos/hal_microchip/pic32c/pic32cz_ca/pic32cz_ca70/include/pio/pic32cz2051ca70100.h
#define PIN_PD18B_USART2_RTS2                      _UINT32_(114)        /* USART2 signal: USART2_RTS2 on PD18 mux B */
#define MUX_PD18B_USART2_RTS2                      _UINT32_(1)          /* USART2 signal line function value: USART2_RTS2 */
#define PIO_PD18B_USART2_RTS2                      (_UINT32_(1) << 18)  /* USART2 signal: USART2_RTS2 */

#define PIN_PD15B_USART2_RXD2                      _UINT32_(111)        /* USART2 signal: USART2_RXD2 on PD15 mux B */
#define MUX_PD15B_USART2_RXD2                      _UINT32_(1)          /* USART2 signal line function value: USART2_RXD2 */
#define PIO_PD15B_USART2_RXD2                      (_UINT32_(1) << 15)  /* USART2 signal: USART2_RXD2 */

#define PIN_PD17B_USART2_SCK2                      _UINT32_(113)        /* USART2 signal: USART2_SCK2 on PD17 mux B */
#define MUX_PD17B_USART2_SCK2                      _UINT32_(1)          /* USART2 signal line function value: USART2_SCK2 */
#define PIO_PD17B_USART2_SCK2                      (_UINT32_(1) << 17)  /* USART2 signal: USART2_SCK2 */

#define PIN_PD16B_USART2_TXD2                      _UINT32_(112)        /* USART2 signal: USART2_TXD2 on PD16 mux B */
#define MUX_PD16B_USART2_TXD2                      _UINT32_(1)          /* USART2 signal line function value: USART2_TXD2 */
#define PIO_PD16B_USART2_TXD2                      (_UINT32_(1) << 16)  /* USART2 signal: USART2_TXD2 */

/* =================== PIO definition for ICE peripheral ==================== */
#define PIN_PB07X1_ICE_SWDCLK                      _UINT32_(39)         /* ICE signal: ICE_SWDCLK on PB07 mux X1 */
#define PIO_PB07X1_ICE_SWDCLK                      (_UINT32_(1) << 7)   /* ICE signal: ICE_SWDCLK */

#define PIN_PB06X1_ICE_SWDIO                       _UINT32_(38)         /* ICE signal: ICE_SWDIO on PB06 mux X1 */
#define PIO_PB06X1_ICE_SWDIO                       (_UINT32_(1) << 6)   /* ICE signal: ICE_SWDIO */

#define PIN_PB07X1_ICE_TCK                         _UINT32_(39)         /* ICE signal: ICE_TCK on PB07 mux X1 */
#define PIO_PB07X1_ICE_TCK                         (_UINT32_(1) << 7)   /* ICE signal: ICE_TCK */

#define PIN_PB04X1_ICE_TDI                         _UINT32_(36)         /* ICE signal: ICE_TDI on PB04 mux X1 */
#define PIO_PB04X1_ICE_TDI                         (_UINT32_(1) << 4)   /* ICE signal: ICE_TDI */

#define PIN_PB05X1_ICE_TDO                         _UINT32_(37)         /* ICE signal: ICE_TDO on PB05 mux X1 */
#define PIO_PB05X1_ICE_TDO                         (_UINT32_(1) << 5)   /* ICE signal: ICE_TDO */

#define PIN_PB06X1_ICE_TMS                         _UINT32_(38)         /* ICE signal: ICE_TMS on PB06 mux X1 */
#define PIO_PB06X1_ICE_TMS                         (_UINT32_(1) << 6)   /* ICE signal: ICE_TMS */

#define PIN_PB05X1_ICE_TRACESWO                    _UINT32_(37)         /* ICE signal: ICE_TRACESWO on PB05 mux X1 */
#define PIO_PB05X1_ICE_TRACESWO                    (_UINT32_(1) << 5)   /* ICE signal: ICE_TRACESWO */

/* =================== PIO definition for TPIU peripheral =================== */
#define PIN_PD08D_TPIU_TRACECLK                    _UINT32_(104)        /* TPIU signal: TPIU_TRACECLK on PD08 mux D */
#define MUX_PD08D_TPIU_TRACECLK                    _UINT32_(3)          /* TPIU signal line function value: TPIU_TRACECLK */
#define PIO_PD08D_TPIU_TRACECLK                    (_UINT32_(1) << 8)   /* TPIU signal: TPIU_TRACECLK */

#define PIN_PD04C_TPIU_TRACED0                     _UINT32_(100)        /* TPIU signal: TPIU_TRACED0 on PD04 mux C */
#define MUX_PD04C_TPIU_TRACED0                     _UINT32_(2)          /* TPIU signal line function value: TPIU_TRACED0 */
#define PIO_PD04C_TPIU_TRACED0                     (_UINT32_(1) << 4)   /* TPIU signal: TPIU_TRACED0 */

#define PIN_PD05C_TPIU_TRACED1                     _UINT32_(101)        /* TPIU signal: TPIU_TRACED1 on PD05 mux C */
#define MUX_PD05C_TPIU_TRACED1                     _UINT32_(2)          /* TPIU signal line function value: TPIU_TRACED1 */
#define PIO_PD05C_TPIU_TRACED1                     (_UINT32_(1) << 5)   /* TPIU signal: TPIU_TRACED1 */

#define PIN_PD06C_TPIU_TRACED2                     _UINT32_(102)        /* TPIU signal: TPIU_TRACED2 on PD06 mux C */
#define MUX_PD06C_TPIU_TRACED2                     _UINT32_(2)          /* TPIU signal line function value: TPIU_TRACED2 */
#define PIO_PD06C_TPIU_TRACED2                     (_UINT32_(1) << 6)   /* TPIU signal: TPIU_TRACED2 */

#define PIN_PD07C_TPIU_TRACED3                     _UINT32_(103)        /* TPIU signal: TPIU_TRACED3 on PD07 mux C */
#define MUX_PD07C_TPIU_TRACED3                     _UINT32_(2)          /* TPIU signal line function value: TPIU_TRACED3 */
#define PIO_PD07C_TPIU_TRACED3                     (_UINT32_(1) << 7)   /* TPIU signal: TPIU_TRACED3 */



#endif /* _pic32cz2051ca70100_GPIO_H_ */

